#11. เขียนโปรแกรมรับอินพุต 1 ตัว เป็นจํานวนเงินในหน่วยบาท (จํานวนจริง) และ ตรวจสอบว่า จํานวนที่รับมามีค่ามากกว่า 0 หรือไม่ 
#• ถ้ามีค่ามากกว่า 0 ให้คํานวณจํานวนเงินในหน่วยดอลล่าที่สามารถแลก ได้ และกําไรที่ธนาคารได้ โดยที่ธนาคารขายเงินดอลล่าที่ราคา 32.80 บาท (ซึ่งธนาคารจะได้กําไร 0.30 บาท) พิมพ์จํานวนเงินดอลล่าที่แลกได้ และกําไรของธนาคาร 
#• ถ้ามีค่าน้อยกว่าหรือเท่ากับ 0 ให้พิมพ์ “you don't have money”  


Baht = float(input("กรอกจำนวนเงินบาท : "))

USD = Baht/32.8

profit = USD*0.30

if Baht > 0 :
    print(f"คุณมีเงินจำนวน {Baht:.2f} บาท")
    print(f"คุณสามารแลกเงินดอลลาร์ได้ในจำนวน {USD:.2f} เหรียญ ")
    print(f"ธนาคารจะได้กำไรจำนวน {profit:.2f} บาท")
    