#18. ถ้าคุณเป็นโปรแกรมเมอร์ที่ห้างสรรพสินค้าแห่งหนึ่ง คุณได้รับมอบหมายให้เขียนโปรแกรมซึ่งมีรายละเอียดดังต่อไปนี้
#	• รับอินพุต 2 ตัว ที่เป็นจำนวนเต็ม (hour,minute) เพื่อคำนวณค่าที่จอดรถ
#	• โดยชั่วโมงแรกจอดฟรี หลังจากนั้นเสียค่าจอด ชั่วโมงละ 30 บาท
#	• เศษของชั่วโมงนับเป็น 1 ชั่วโมง
#	• จากนั้นพิมพ์ค่าจอดรถออกมา

Hr = int(input("กรอกจำนวนชั่วโมง : "))
Min = int(input("กรอกจำนวนนาที : ")) 
print("ใน1ชั่วโมงแรกฟรีค่าบริการ หลังจากนั้นเสียค่าจอด ชั่วโมงละ 30 บาท")


if Hr > 1 :
    SCP = Hr*30
    print(f"คุณจอดรดเป็นเวลา {Hr} ชั่วโมง {Min} นาที")
    print(f"ค่าบริการของคุณอยู่ที่ {SCP}")
elif Hr+Min > 1 :
    SCP = Hr*30
    print(f"คุณจอดรดเป็นเวลา {Hr} ชั่วโมง {Min} นาที")
    print(f"ค่าบริการของคุณอยู่ที่ {SCP}")
        
elif Hr == 0 :
    print("ใน1ชั่วโมงแรกฟรีค่าบริการ หลังจากนั้นเสียค่าจอด ชั่วโมงละ 30 บาท")
    print(f"คุณจอดรดเป็นเวลา {Hr} ชั่วโมง {Min} นาที")
    print(f"ค่าบริการของคุณอยู่ที่ 0 บาท")
elif Min == 0 :
    print("ใน1ชั่วโมงแรกฟรีค่าบริการ หลังจากนั้นเสียค่าจอด ชั่วโมงละ 30 บาท")
    print(f"คุณจอดรดเป็นเวลา {Hr} ชั่วโมง {Min} นาที")
    print(f"ค่าบริการของคุณอยู่ที่ 0 บาท")