#7. เขียนโปรแกรมรับตัวเลข 2 ตัว ที่เป็นจำนวนเต็ม (width,length) และตรวจสอบว่า
#	ถ้าตัวเลขตัวใดตัวหนึ่งหรือทั้งสองตัว เป็นเลข 0 หรือ ติดลบ 
#		ให้พิมพ์ กรุณากรอกจำนวนเต็มบวก
#	แต่ถ้า เป็นจำนวนเต็มบวกทั้งคู่ให้คำนวณพื้นที่สามเหลี่ยม
#
width = float(input("ความสูง :"))
length = float(input("ความยาว :"))

if width and length > 0 :
    print("พื้นที่สามเหลี่aยมนี้มีขนาด คือ ",float(width*length*0.5))
elif width and length <= 0 :
    print("กรุณากรอกตัวเลขจำนวนเต็มบวก")
else :
    print("กรุณากรอกตัวเลขจำนวนเต็มบวก")
    

